tap "ankitpokhrel/jira-cli"
tap "asmvik/formulae", "https://github.com/asmvik/homebrew-formulae.git"
tap "atlassian/acli"
tap "jesseduffield/lazydocker"
tap "nikitabobko/tap"
tap "tw93/tap"
tap "y3owk1n/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Tool for provisioning self-hosted development environments with Terraform
brew "coder"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg", link: false
# Play, record, convert, and stream many audio and video codecs
brew "ffmpeg-full", link: true
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Open-source GitLab command-line tool
brew "glab"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in select formats
brew "imagemagick", link: false
# Tools and libraries to manipulate images in many formats
brew "imagemagick-full", link: true
# Feature-rich interactive Jira CLI
brew "jira-cli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Helps you navigate your file system faster by learning your habits
brew "jump"
# Handy way to save and run project-specific commands
brew "just"
# Simple terminal UI for git commands
brew "lazygit", link: false
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Theme for zsh
brew "powerlevel10k"
# Python version management
brew "pyenv"
# SVG rendering tool and library
brew "resvg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Markup-based typesetting system
brew "typst"
# Extraction utility for .zip compressed archives
brew "unzip"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Copy terminal output to clipboard
brew "yank"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# A simple terminal UI for docker, written in Go
brew "jesseduffield/lazydocker/lazydocker", trusted: true
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Terminal-based AI coding assistant
cask "claude-code"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Virtual workspace manager
cask "flashspace"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-noto-sans-arabic"
cask "font-symbols-only-nerd-font"
# Desktop automation application
cask "hammerspoon"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar manager
cask "jordanbaird-ice"
# Keyboard customiser
cask "karabiner-elements"
# File archiver
cask "keka"
# Open-source keystroke visualiser
cask "keycastr"
# Find shortcuts for any installed application
cask "keyclu"
# Screenshot and screen recording tool
cask "macshot"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Keyboard driven navigation for macOS
cask "y3owk1n/tap/neru"
# Replacement for Docker Desktop
cask "orbstack"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Menu bar manager
cask "thaw@beta"
# Menu bar pomodoro timer
cask "tomatobar"
# Tool to invert scroll direction for physical scroll wheels
cask "unnaturalscrollwheels"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
vscode "anthropic.claude-code"
vscode "esbenp.prettier-vscode"
vscode "google.geminicodeassist"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
uv "gitlab-mr-mcp"
uv "pre-commit"
npm "corepack"
npm "prettier"
